app/Controllers/dashboardController.php

INSERT INTO `admin` (`nama`, `email`, `password`) VALUES ('admin', 'admin@email.com', '$2y$10$iwzvqADMZ3fmtZikufPjZeR6yoK5kKdhSspUpogUhcmF02srYOtBS')
---
    public function register()
    {
        $AdminLoginModel = new AdminLoginModel();
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nama' => 'required|min_length[3]|max_length[128]',
            'email' => 'required|valid_email',
            'password' => 'required|min_length[8]',
            'confirm_password' => 'required|matches[password]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $user = [
            'nama' => $this->request->getPost('nama'),
            'email' => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ];

        $AdminLoginModel->insert($user);

SELECT *
FROM `konsentrasi`
---
    function konsentrasi()
    {
        $session = session();
        if ($session->get('logged_in')) {
            $matakuliahModel = new \App\Models\konsentrasiModel();
            $data['konsentrasi'] = $matakuliahModel->findAll();